
** Setup package repos 
 #+BEGIN_SRC emacs-lisp

 ;; Package configs
 (require 'package)
 (setq package-enable-at-startup nil)
 (setq package-check-signature nil)
 (setq package-archives '(("org"   . "https://orgmode.org/elpa/")
                          ("gnu"   . "https://elpa.gnu.org/packages/")
                          ("melpa" . "https://melpa.org/packages/"))) 

 (package-initialize)
 (unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))


 #+END_SRC

 #+RESULTS:
 : ((org . http://orgmode.org/elpa/) (gnu . http://elpa.gnu.org/packages/) (melpa . https://melpa.org/packages/) (melpa . http://melpa.milkbox.net/packages/))

** calender
 #+BEGIN_SRC emacs-lisp
(copy-face font-lock-constant-face 'calendar-iso-week-face)
(set-face-attribute 'calendar-iso-week-face nil
                    :height 0.7)
(setq calendar-intermonth-text
      '(propertize
        (format "%2d"
                (car
                 (calendar-iso-from-absolute
                  (calendar-absolute-from-gregorian (list month day year)))))
        'font-lock-face 'calendar-iso-week-face))
 #+END_SRC

 #+RESULTS:
 | propertize | (format %2d (car (calendar-iso-from-absolute (calendar-absolute-from-gregorian (list month day year))))) | (quote font-lock-face) | (quote calendar-iso-week-face) |
** ace-window
 #+BEGIN_SRC emacs-lisp
 (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
 #+END_SRC

 #+RESULTS:
 | 97 | 115 | 100 | 102 | 103 | 104 | 106 | 107 | 108 |
 
** orgmode config
 #+BEGIN_SRC emacs-lisp
 ;; OrgMode Configs
 (setq org-html-validation-link nil)
 (setq org-clock-sound "/usr/share/xpra/bell.wav") 
 (setq org-enforce-todo-dependencies t)
 (setq org-todo-keywords
       '(
       (sequence "TODO(t)" "NEXT(n)" "HOLD(h)" "|" "DONE(d)" "CANCELLED(c)")
       (sequence "PROJECT" "MABY" "|" "FINNISHED(d)" "CANCELLED(c)")
       ))
 (setq org-todo-keyword-faces
       '(("TODO"    . "blue")
	 ("NEXT"    . "yellow")
	 ("HOLD"    . "red")
	 ("DONE"    . "green")))
	
 (setq org-stuck-projects
      '("+LEVEL=2+PROJECT/-MAYBE-DONE" ("NEXT" "TODO") ("@shop")
        "\\<IGNORE\\>"))

 (setq
  org-directory "~/notes/org"
  org-default-notes-file (concat org-directory "/refile.org")
  org-refile-targets (quote ((nil :maxlevel . 3)
 			       ("~/notes/org/projects.org" :maxlevel . 3)
 			       ("~/notes/org/tickler.org" :maxlevel . 3)
 			       ("~/notes/org/shopping.org" :maxlevel . 3)
 			       ("~/notes/org/inbox.org" :maxlevel . 3)
 			       ("~/notes/org/somedayMaby.org" :maxlevel . 3)))
)
(setq org-agenda-files (list org-directory))
  
 (define-key global-map (kbd "C-c t")
   (lambda () (interactive) (org-capture nil "t")))
       
 (define-key global-map (kbd "C-c c")
   (lambda () (interactive) (org-capture nil )))
      
 (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t) (shell . t)))
   
 (defun my-org-confirm-babel-evaluate (lang body)
   (not (member lang '("C" "clojure" "shell" "python" "plantuml" "emacs-lisp"))))
 (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
 
 (add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)
 
 (defun my-org-mode-settings ()
   (toggle-word-wrap)
   (toggle-truncate-lines))
(add-hook 'org-mode-hook 'my-org-mode-settings)
 
(define-key global-map (kbd "M-v")
   (lambda () (interactive) (org-babel-execute-src-block)))
 #+END_SRC

 #+RESULTS:
 | lambda | nil | (interactive) | (org-babel-execute-src-block) |
** org agenda
 #+BEGIN_SRC emacs-lisp
 (setq org-agenda-span 10)
	   
 (setq org-agenda-custom-commands 
      '(
	("W" "Weekly Review"
         ((agenda "" ((org-agenda-span 7))); review upcoming deadlines and appointments
                                           ; type "l" in the agenda to review logged items 
          (stuck "") ; review stuck projects as designated by org-stuck-projects
          (todo "PROJECT") ; review all projects (assuming you use todo keywords to designate projects)
          (todo "MAYBE") ; review someday/maybe items
          (todo "WAITING"))) ; review waiting items
         ;; ...other commands here
	 
	 
	 ("d" "Upcoming deadlines" agenda "" 
                ((org-agenda-time-grid nil)
                 (org-deadline-warning-days 365)        ;; [1]
                 (org-agenda-entry-types '(:deadline))  ;; [2]
                 ))
         ;; ...other commands here
	 
	 ("g" . "GTD contexts")
         ("go" "Office" tags-todo "office")
         ("gc" "Computer" tags-todo "computer")
         ("gp" "Phone" tags-todo "phone")
         ("gh" "Home" tags-todo "home")
         ("ge" "Errands" tags-todo "errands")
         ("G" "GTD Block Agenda"
         ((tags-todo "office")
          (tags-todo "computer")
          (tags-todo "phone")
          (tags-todo "home")
          (tags-todo "errands"))
         nil                      ;; i.e., no local settings
         ("~/next-actions.html")) ;; exports block to this file with C-c a e
       ;; ..other commands here
       
       ("p" . "Priorities")
        ("pa" "A items" tags-todo "+PRIORITY=\"A\"")
        ("pb" "B items" tags-todo "+PRIORITY=\"B\"")
        ("pc" "C items" tags-todo "+PRIORITY=\"C\"")
        ;; ...other commands here
	
	("c"  "Weekly schedule" agenda ""
        ((org-agenda-span 7)           ;; agenda will start in week view
        (org-agenda-repeating-timestamp-show-all t)   ;; ensures that repeating events appear on all relevant dates
        (org-agenda-entry-types '(:sheduled))  ;; [2]
        (org-agenda-entry-types '(:deadline) )))  ;; [2]
        ;(org-agenda-skip-function '(org-agenda-skip-entry-if '(:deadline) 'scheduled))))  
        ;; limits agenda view to timestamped items
        ;; ...other commands here
	
	("h" "Daily habits" 
         ((agenda ""))
         ((org-agenda-show-log t)
          (org-agenda-ndays 7)
          (org-agenda-log-mode-items '(state))
          (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp ":habit:"))))
        ;; other commands here
	
	("P" "Printed agenda"
         ((agenda "" ((org-agenda-span 7)                      ;; overview of appointments
                      (org-agenda-start-on-weekday nil)         ;; calendar begins today
                      (org-agenda-repeating-timestamp-show-all t)
                      (org-agenda-entry-types '(:timestamp :sexp))))
          (agenda "" ((org-agenda-span 1)                      ; daily agenda
                      (org-deadline-warning-days 7)            ; 7 day advanced warning for deadlines
                      (org-agenda-todo-keyword-format "[ ]")
                      (org-agenda-scheduled-leaders '("" ""))
                      (org-agenda-prefix-format "%t%s")))
          (todo "TODO"                                          ;; todos sorted by context
                ((org-agenda-prefix-format "[ ] %T: ")
                 (org-agenda-sorting-strategy '(tag-up priority-down))
                 (org-agenda-todo-keyword-format "")
                 (org-agenda-overriding-header "\nTasks by Context\n------------------\n"))))
         ((org-agenda-with-colors nil)
          (org-agenda-compact-blocks t)
          (org-agenda-remove-tags t)
          (ps-number-of-columns 2)
           (ps-landscape-mode t))
         ("~/agenda.ps"))
        ;; other commands go here
        ))
 #+END_SRC

 #+RESULTS:
 : ((w Work alltodo  ((org-agenda-files (quote (~/unity-vr-bachelor/todo.org))) (org-agenda-sorting-strategy (quote (priority-up effort-down))))) (W Weekly Review ((agenda  ((org-agenda-span 7))) (stuck ) (todo PROJECT) (todo MAYBE) (todo WAITING))) (d Upcoming deadlines agenda  ((org-agenda-time-grid nil) (org-deadline-warning-days 365) (org-agenda-entry-types (quote (:deadline))))) (g . GTD contexts) (go Office tags-todo office) (gc Computer tags-todo computer) (gp Phone tags-todo phone) (gh Home tags-todo home) (ge Errands tags-todo errands) (G GTD Block Agenda ((tags-todo office) (tags-todo computer) (tags-todo phone) (tags-todo home) (tags-todo errands)) nil (~/next-actions.html)) (p . Priorities) (pa A items tags-todo +PRIORITY="A") (pb B items tags-todo +PRIORITY="B") (pc C items tags-todo +PRIORITY="C") (c Weekly schedule agenda  ((org-agenda-span 7) (org-agenda-repeating-timestamp-show-all t) (org-agenda-entry-types (quote (:sheduled))) (org-agenda-entry-types (quote (:deadline))))) (h Daily habits ((agenda )) ((org-agenda-show-log t) (org-agenda-ndays 7) (org-agenda-log-mode-items (quote (state))) (org-agenda-skip-function (quote (org-agenda-skip-entry-if (quote notregexp) :habit:))))) (P Printed agenda ((agenda  ((org-agenda-span 7) (org-agenda-start-on-weekday nil) (org-agenda-repeating-timestamp-show-all t) (org-agenda-entry-types (quote (:timestamp :sexp))))) (agenda  ((org-agenda-span 1) (org-deadline-warning-days 7) (org-agenda-todo-keyword-format [ ]) (org-agenda-scheduled-leaders (quote ( ))) (org-agenda-prefix-format %t%s))) (todo TODO ((org-agenda-prefix-format [ ] %T: ) (org-agenda-sorting-strategy (quote (tag-up priority-down))) (org-agenda-todo-keyword-format ) (org-agenda-overriding-header 
 : Tasks by Context
 : ------------------
 : )))) ((org-agenda-with-colors nil) (org-agenda-compact-blocks t) (org-agenda-remove-tags t) (ps-number-of-columns 2) (ps-landscape-mode t)) (~/agenda.ps)))

** treemacs
 #+begin_src emacs-lisp

 ;;treemacs
 (use-package treemacs
   :ensure t
   :defer t
   :init
   (with-eval-after-load 'winum
     (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
   :config
   (progn
     (setq treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
           treemacs-deferred-git-apply-delay      0.5
           treemacs-directory-name-transformer    #'identity
           treemacs-display-in-side-window        t
           treemacs-eldoc-display                 t
           treemacs-file-event-delay              5000
           treemacs-file-extension-regex          treemacs-last-period-regex-value
           treemacs-file-follow-delay             0.2
           treemacs-file-name-transformer         #'identity
           treemacs-follow-after-init             t
           treemacs-git-command-pipe              ""
           treemacs-goto-tag-strategy             'refetch-index
           treemacs-indentation                   2
           treemacs-indentation-string            " "
           treemacs-is-never-other-window         nil
           treemacs-max-git-entries               5000
           treemacs-missing-project-action        'ask
           treemacs-no-png-images                 nil
           treemacs-no-delete-other-windows       t
           treemacs-project-follow-cleanup        nil
           treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
           treemacs-position                      'left
           treemacs-recenter-distance             0.1
           treemacs-recenter-after-file-follow    nil
           treemacs-recenter-after-tag-follow     nil
           treemacs-recenter-after-project-jump   'always
           treemacs-recenter-after-project-expand 'on-distance
           treemacs-show-cursor                   nil
           treemacs-show-hidden-files             t
           treemacs-silent-filewatch              nil
           treemacs-silent-refresh                nil
           treemacs-sorting                       'alphabetic-asc
           treemacs-space-between-root-nodes      nil
           treemacs-tag-follow-cleanup            t
           treemacs-tag-follow-delay              1.5
           treemacs-user-mode-line-format         nil
           treemacs-width                         35)

     ;; The default width and height of the icons is 22 pixels. If you are
     ;; using a Hi-DPI display, uncomment this to double the icon size.
     ;;(treemacs-resize-icons 44)

     (treemacs-follow-mode t)
     (treemacs-filewatch-mode t)
     (treemacs-fringe-indicator-mode t)
     (pcase (cons (not (null (executable-find "git")))
                  (not (null treemacs-python-executable)))
       (`(t . t)
	(treemacs-git-mode 'deferred))
       (`(t . _)
	(treemacs-git-mode 'simple))))
   :bind
   (:map global-map
         ("M-0"       . treemacs-select-window)
         ("C-x t 1"   . treemacs-delete-other-windows)
         ("C-x t t"   . treemacs)
         ("C-x t B"   . treemacs-bookmark)
         ("C-x t C-t" . treemacs-find-file)
         ("C-x t M-t" . treemacs-find-tag)))

 (use-package treemacs-evil
   :after treemacs evil
   :ensure t)

 (use-package treemacs-projectile
   :after treemacs projectile
   :ensure t)

 (use-package treemacs-icons-dired
   :after treemacs dired
   :ensure t
   :config (treemacs-icons-dired-mode))

 (use-package treemacs-magit
   :after treemacs magit
   :ensure t)

 (use-package treemacs-persp
   :after treemacs persp-mode
   :ensure t
   :config (treemacs-set-scope-type 'Perspectives))
 #+END_SRC

 #+RESULTS:
 
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'treemacs

  (defun treemacs-ignore-example (filename absolute-path)
    (or (string-equal filename "__pycache__")
        (string-equal filename ".mypy_cache")
        (string-equal filename ".idea")
        (string-equal filename ".vscode")
        (string-prefix-p "/x/y/z/" absolute-path)
        (string-suffix-p "org_archive" filename)
        (string-suffix-p "meta" filename)))

  (add-to-list 'treemacs-ignored-file-predicates #'treemacs-ignore-example))
    
 (with-eval-after-load 'treemacs
  (add-to-list 'treemacs-pre-file-insert-predicates #'treemacs-is-file-git-ignored?))
    
 #+END_SRC

 #+RESULTS:
 | treemacs-is-file-git-ignored? |

